eniac77/ESP32S3_SWD_PROG/sdkconfig.defaults
# --- Cél: ESP32-S3-N16R8 (16 MB flash, 8 MB octal PSRAM) ---
CONFIG_IDF_TARGET="esp32s3"

# Flash méret
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Octal PSRAM (R8) — kötelező R8 modulhoz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Egyedi partíciós tábla
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS tick: 1 ms (UI/serial időzítéshez kényelmes)
CONFIG_FREERTOS_HZ=1000

# HTTP szerver WebSocket támogatás (web_ui /ws élő adat + progress)
CONFIG_HTTPD_WS_SUPPORT=y

# Naplózás: VERBOSE szint befordítva, alap szint DEBUG (a SWD/FLM tag-ek
# VERBOSE-ra emelve futásidőben a main-ben). Teljes UART-konzol napló.
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# LVGL (display_lcd / ILI9488): 16-bit színmélység (RGB565). Az esp_lcd_ili9488
# driver RGB565->RGB666 konverziót végez, ezért ez KÖTELEZŐ. (Az LVGL-Kconfig
# default amúgy is 16, de itt explicit rögzítjük, hogy ne csússzon el.)
CONFIG_LV_COLOR_DEPTH_16=y
